package FloodTheSite;
/* Игра "Потопи сайт", аналог морского боя, только вместо кораблей - URL сайтов.
   Размер игрового поля 7х7, все сайты имеют размер 1х3 либо 3х1.
   Техническое задание:
   1. Эта версия для однострочного игрового поля 1х7.
   2. Вывести приветствие и создать необходимые для игры переменные и структуры.
   3. Расположить случайным образом на игровом поле сайт "my.ru".
   4. Вводить X-координату (Y=1) выстрела игрока, до полного уничтожения сайта.
   5. После полного потопления, сообщить о Победе и вывести статистику - время игры и количество потраченных выстрелов.

   Общая идея игры:
   1. Пользователь запускает игру.
      - Игра создает три "сайта".
      - Игра размещает "сайты" на игровом поле.
   2. Игра начинается. Повторять цикл до потпления всех "сайтов".
      - Предложить полльзователю сделать ход (A0, B3 и т.д.)
      - Проверить всее сайты на попадание, промах и потопление.
      - Если попадание, то отмечаем ячейку как подбитую.
      - Если все ячейки "сайта" потоплены, то удалить "сайт" (потоплен).
    3. Игра заканчивается.
      - Показать пользователю рейтинг, основываясь на времени и количестве попыток.
*/
public class SimpleFloodTheSiteGame {
    public static void main(String[] args) {
        TheSite test = new TheSite();
        test.checkTarget("");
    }
}
