package FloodTheSite;
public class TheSite {
    // Координаты полей расположения сайта на игровом поле.
    private final int[] locationCells = new int[3];
    // Количество попаданий.
    int numOfHits = 0;

    // Параметры:
    // Ход пользователя:String - 1, 3 ,5 и т.д..
    // Результат:String - Попал, Мимо, Потопил.
    public String checkTarget(String target) {
        // Преобразуем полученный ход пользователя в целое число.
        // цикл по всем полям, занятым сайтом.
            // Сравниваем ход пользователя с адресом очередного поля сайта.
            // Если пользователь угадал
                // Увеличиваем счетчик попаданий.
                numOfHits++;
                // Определяем, было ли это последнее "живое" поле сайта.
                // Если было 3 попадания, то возвращаем "потопил"
                // Иначе возвращаем "Попал"
            // Иначе возвращаем "Мимо"
        // конец цикла
        return "Попал";
    }

    // Выполняет запись координат полей, в которых располагается сайт.
    public void setLocationCells(int[] cells) {
        // Проверяем полученный массив координат на соответствие игровому полю 7х7.
        // Если проверка успешна, то присваиваем полученный массив адресов
        // внутреннему хранилищу координат полей сайта
        locationCells[0] = 0;
    }
}
